/* eslint-disable no-useless-concat */
import avatar_1 from '../img/avatars/Borodulin_RI.jpg';
import avatar_2 from '../img/avatars/Brovka_PU.jpg';
import avatar_3 from '../img/avatars/Byadulya_Z.jpg';
import avatar_4 from '../img/avatars/Gilevich_NS.jpg';
import avatar_5 from '../img/avatars/Zuenok_VV.jpg';
import avatar_6 from '../img/avatars/Kullinkovich_AM.jpg';

import poet1_1 from '../img/gallery/1.1.jpg';
import poet1_2 from '../img/gallery/1.2.jpg';
import poet1_3 from '../img/gallery/1.3.jpg';
import poet1_4 from '../img/gallery/1.4.jpg';
import poet1_5 from '../img/gallery/1.5.jpg';
import poet1_6 from '../img/gallery/1.6.jpg';
import poet1_7 from '../img/gallery/1.7.jpg';
import poet1_8 from '../img/gallery/1.8.jpg';
import poet1_9 from '../img/gallery/1.9.jpg';
import poet1_10 from '../img/gallery/1.10.jpg';

import poet2_1 from '../img/gallery/2.1.jpg';
import poet2_2 from '../img/gallery/2.2.jpg';
import poet2_3 from '../img/gallery/2.3.jpg';
import poet2_4 from '../img/gallery/2.4.jpg';
import poet2_5 from '../img/gallery/2.5.jpg';
import poet2_6 from '../img/gallery/2.6.jpg';

import poet3_1 from '../img/gallery/3.1.jpg';
import poet3_2 from '../img/gallery/3.2.jpg';
import poet3_3 from '../img/gallery/3.3.jpg';
import poet3_4 from '../img/gallery/3.4.jpg';
import poet3_5 from '../img/gallery/3.5.jpg';
import poet3_6 from '../img/gallery/3.6.jpg';

import poet4_1 from '../img/gallery/4.1.jpg';
import poet4_2 from '../img/gallery/4.2.jpg';
import poet4_3 from '../img/gallery/4.3.jpg';
import poet4_4 from '../img/gallery/4.4.jpg';
import poet4_5 from '../img/gallery/4.5.jpg';
import poet4_6 from '../img/gallery/4.6.jpg';

import poet5_1 from '../img/gallery/5.1.jpg';
import poet5_2 from '../img/gallery/5.2.jpg';
import poet5_3 from '../img/gallery/5.3.jpg';
import poet5_4 from '../img/gallery/5.4.jpg';

import poet6_1 from '../img/gallery/6.1.jpg';
import poet6_2 from '../img/gallery/6.2.jpg';
import poet6_3 from '../img/gallery/6.3.jpg';
import poet6_4 from '../img/gallery/6.4.jpg';

export default [
  {
    id: 1,
    name: 'Григорий Иванович Бородулин',
    avatar: avatar_1,
    occupation: 'поэт, эссеист, переводчик',
    birthDate: '24.02.1935',
    birthPlace: 'хутор Вересовка, Ушачский район, Витебская область, БССР, СССР',
    deathDate: '02.03.2014',
    deathPlace: 'Минск, Беларусь',
    locationsCoords: {
      lat: '53.902496',
      lng: '27.561481',
    },
    works: [
      {
        name: 'Месяц над степью',
        publishYear: '1959',
      },
      {
        name: 'Слова о полку Игореве',
        publishYear: '1986',
      },
      {
        name: 'Руны Перуновы',
        publishYear: '2006',
      },
    ],
    youTubeVideoId: 'WzJFsmUvTzI',
    activity: [
      {
        date: '24.02.1935',
        place: 'Вересовка',
        description:
          'Родился на хуторе Вересовка, официальное название хутора было «Городок-2» ' +
          '(ныне это северо-западная окраина дер. Тихоняты Сорочинского сельсовета).',
      },
      {
        date: '1954',
        place: 'Вересовка',
        description: 'Окончил Ушачскую среднюю школу.',
      },
      {
        date: '1959',
        place: 'Вересовка',
        description: 'Окончил филологический факультет БГУ.',
      },
      {
        date: '1984',
        place: 'Лусака, Замбия',
        description: 'В составе государственной делегации Белорусской ССР Бородулин принимал участие в 39 сессии Генеральной ассамблеи ООН.',
      },
      {
        date: '1992',
        place: 'Минск',
        description: 'Стал последним белорусом, удостоившимся звания народного поэта.',
      },
      {
        date: '02.03.2014',
        place: 'Минск',
        description: 'Умер 2 марта 2014 года в своей квартире в Минске на 80-ом году жизни от болезни Паркинсона.',
      },
    ],
    imgData: [
      {
        img: poet1_1,
        title: 'В день получения университетского диплома.1959 год',
      },
      {
        img: poet1_2,
        title: 'С дочерью Илоной. 1967 год',
      },
      {
        img: poet1_3,
        title: 'Начинающие литераторы с Якубом Коласом. Бородулин стоит слева от Коласа. 1955 год',
      },
      {
        img: poet1_4,
        title: 'С Максимом Танком (слева). Выступление в Туве. 1964 год',
      },
      {
        img: poet1_5,
        title: 'С Владимиром Короткевичем и собакой Дозором. Королищевичи. 1965 год',
      },
      {
        img: poet1_6,
        title: 'На родине родителей в деревне Ковалевщина. 1972 год',
      },
      {
        img: poet1_7,
        title: 'Первокурсники на картошке. Деревня Новый Двор Минского района. 1954 год',
      },
      {
        img: poet1_8,
        title: 'Первокурсники на картошке. Деревня Новый Двор Минского района. 1954 год',
      },
      {
        img: poet1_9,
        title:
          'В университетском скверике. Рыгор Бородулин, Анатолий Клышко, Василий Зуенок, Анатолий Вертинский, Геннадь Буравкин. Сидят: Юрась Свирка, Микола Арочка, Кастусь Цвирка.',
      },
      {
        img: poet1_10,
        title: 'На военных сборах. Анатолий Ставров, Алесь Булыка, Рыгор Бородулин',
      },
    ],
  },
  {
    id: 2,
    name: 'Пётр Устинович Бровка',
    avatar: avatar_2,
    occupation: 'поэт, прозаик, переводчик, драматург, публицист, редактор',
    birthDate: '25.06.1905',
    birthPlace: 'Путилковичи, Борисовский уезд, Минская губерния, Российская империя',
    deathDate: '24.03.1980',
    deathPlace: 'Минск, БССР, СССР',
    locationsCoords: {
      lat: '53.902496',
      lng: '27.561481',
    },
    works: [
      {
        name: 'Цэхавыя будні',
        publishYear: '1931',
      },
      {
        name: 'Прыход героя',
        publishYear: '1935',
      },
      {
        name: 'Вершы і паэмы',
        publishYear: '1940',
      },
      {
        name: 'Пахне чабор',
        publishYear: '1959',
      },
    ],
    youTubeVideoId: 'y7q6WXFqP2I',
    activity: [
      {
        date: '25.06.1905',
        place: 'Путилковичи',
        description:
          'Родился 25 июня 1905 года в деревне Путилковичи ' +
          '(ныне Ушачский район, Витебская область, Белоруссия) в крестьянской ' +
          'семье (9 детей). Отец — Устин Адамович. Мать — Алёна Степановна. ' +
          'Окончил церковно-приходскую школу в Лепеле.',
      },
      {
        date: '1918—1924',
        place: 'Полоцк',
        description:
          'В 1918—1924 годах работал переписчиком, делопроизводителем ' +
          'и счетоводом. В 1925—1927 годах был завотделом Окружкома комсомола в ' +
          'Полоцке. ',
      },
      {
        date: '1925—1927',
        place: 'Полоцк',
        description: 'В 1925—1927 годах был завотделом Окружкома комсомола в Полоцке.',
      },
      {
        date: '1927—1928',
        place: 'Полоцк',
        description: 'В 1927—1928 годах — ответственным секретарём редакции ' + 'газеты «Чырвоная Полаччына».',
      },
      {
        date: '1928',
        place: 'Минск',
        description: 'С 1928 года — в литературном объединении «Маладняк», позже в ' + 'Белорусской ассоциации пролетарских писателей (БелАПП).',
      },
      {
        date: '1941—1942',
        place: 'Минск',
        description: 'В 1941—1942 году служил в РККА, работал во фронтовой и ' + 'партизанской печати.',
      },
      {
        date: '1943—1945',
        place: 'Минск',
        description: 'В 1943—1945 годах был ответственным секретарём СП БССР, ' + 'главный редактор литературного журнала «Полымя».',
      },
      {
        date: '1948—1967',
        place: 'Минск',
        description: 'В 1948—1967 годы — председателем Правления СП БССР.',
      },
      {
        date: '1967—1980',
        place: 'Минск',
        description:
          'В 1967—1980 годы — главный редактор Белорусской советской ' + 'энциклопедии (ныне — «Белорусская Энциклопедия имени П. Бровки»).',
      },
      {
        date: '24.03.1980',
        place: 'Минск',
        description: 'П. У. Бровка умер 24 марта 1980 года в Минске. Похоронен на Восточном кладбище.',
      },
    ],
    imgData: [
      {
        img: poet2_1,
        title: 'Петрусь Бровка с Василём Быковым',
      },
      {
        img: poet2_2,
        title: 'Петрусь Бровка',
      },
      {
        img: poet2_3,
        title: 'Бровка с Еленой Михайловной Ридевской',
      },
      {
        img: poet2_4,
        title: 'П. Броўка (сядзіць крайні справа) з удзельнікамі нарады маладых пісьменнікаў (верасень 1955).',
      },
      {
        img: poet2_5,
        title: 'Сцяпан Сямашка, Паўлюк Шукайла, Пятрусь Броўка, Янка Відук (Скрыган). Полацак, 1927 г',
      },
      {
        img: poet2_6,
        title: 'П. Броўка (4-ты справа) на III з’ездзе пісьменнікаў БССР (1954)',
      },
    ],
  },
  {
    id: 3,
    name: 'Змитрок Бядуля',
    avatar: avatar_3,
    occupation: 'поэт, прозаик',
    birthDate: '23.04.1886',
    birthPlace: 'д. Посадец, Виленская губерния, Российская империя',
    deathDate: '03.11.1941',
    deathPlace: 'Уральск, Казахская ССР, СССР',
    locationsCoords: {
      lat: '53.902496',
      lng: '27.561481',
    },
    works: [
      {
        name: 'Пад родным небам',
        publishYear: '1922',
      },
      {
        name: 'Буралом',
        publishYear: '1925',
      },
      {
        name: 'Тры пальцы',
        publishYear: '1930',
      },
    ],
    youTubeVideoId: 'Ic6BBVPd5lc',
    activity: [
      {
        date: '23.04.1886',
        place: 'Посадец',
        description:
          'Самуил (Шмуэл-Нохим) Плавник[1][2], впоследствии известный под литературным ' +
          'псевдонимом Змитрок Бядуля, родился в небогатой еврейской семье.',
      },
      {
        date: '1910',
        place: 'Вильно',
        description: 'Самуил Плавник стал постоянным автором виленской газеты «Наша Ніва».',
      },
      {
        date: '1918',
        place: 'Минск',
        description: 'Сотрудничал с газетой «Беларускі шлях», выходившей под немецкой оккупацией.',
      },
      {
        date: '1918-1919',
        place: 'Минск',
        description: 'Сочувствовал БНР, был автором ряда резко антибольшевистских статей.',
      },
      {
        date: '03.11.1941',
        place: 'Уральск',
        description: 'Скончался около Уральска в Казахстане, где и был похоронен',
      },
    ],
    imgData: [
      {
        img: poet3_1,
        title: 'Змитрок Бядуля',
      },
      {
        img: poet3_2,
        title: 'Змитрок Бядуля с женой ',
      },
      {
        img: poet3_3,
        title: `Літаратурнае аб'яднанне «Узвышша». З. Бядуля ў цэнтры. 1929`,
      },
      {
        img: poet3_4,
        title: 'Змітрок Бядуля і Я. Колас у дзень узнагароджання ордэнамі. 1939',
      },
      {
        img: poet3_5,
        title: 'Якуб Колас, Янка Купала, Пятрусь Броўка, Зьмітрок Бядуля 1930-я гг.',
      },
      {
        img: poet3_6,
        title: 'Змітрок Бядуля і Якуб Колас (у цэнтры) сярод студэнтаў рабфака БДУ, 1922 г.   ',
      },
    ],
  },
  {
    id: 4,
    name: 'Нил Симеонович Гилевич',
    avatar: avatar_4,
    occupation: 'поэт, переводчик, литературовед, фольклорист',
    birthDate: '30.09.1931',
    birthPlace: 'дер. Слобода, Логойский район Минской области, БССР, СССР',
    deathDate: '29.03.2016',
    deathPlace: 'Минск, Беларусь',
    locationsCoords: {
      lat: '53.902496',
      lng: '27.561481',
    },
    works: [
      {
        name: 'Песня ў дарогу',
        publishYear: '1957',
      },
      {
        name: 'Прадвесне ідзе па зямлі',
        publishYear: '1959',
      },
      {
        name: 'Неспакой',
        publishYear: '1961',
      },
      {
        name: 'Дождж-грыбасей',
        publishYear: '1966',
      },
    ],
    youTubeVideoId: 'gSHXeS3sXmk',
    activity: [
      {
        date: '23.04.1886',
        place: 'Слобода',
        description: 'Родился 30 сентября 1931 года в д. Слобода Логойского района Минской области в крестьянской семье.',
      },
      {
        date: '1940-е',
        place: 'Слобода',
        description: 'В середине 1940-х некоторое время работал сельским почтальоном.',
      },
      {
        date: '1951—1956',
        place: 'Минск',
        description:
          'Окончил Минское педагогическое училище имени Н. К. Крупско, филологический факультет Белорусского государственного университета и аспирантуру при нём.',
      },
      {
        date: '1958—1963',
        place: 'Минск',
        description: 'Работал также литературным консультантом газеты «Звязда».',
      },
      {
        date: '1980—1989',
        place: 'Минск',
        description: 'Первый секретарь правления Союза писателей Белорусской ССР.',
      },
      {
        date: '1989',
        place: 'Минск',
        description: 'Председатель ТБМ им. Франциска Скорины, главный редактор бюллетеня данной организации «Наша слова».',
      },
      {
        date: '1985—1995',
        place: 'Минск',
        description: 'Депутат Верховного Совета XI и XII созывов.',
      },
      {
        date: '1990—1995',
        place: 'Минск',
        description: 'Председатель Комитета по образованию, культуре и сохранению исторического наследия.',
      },
      {
        date: '29.03.2016',
        place: 'Минск',
        description: 'Скончался в Минске от онкологического заболевания.',
      },
    ],
    imgData: [
      {
        img: poet4_1,
        title: 'Нил Гилевич и Василий Быков',
      },
      {
        img: poet4_2,
        title: 'Змитрок Бядуля с женой ',
      },
      {
        img: poet4_3,
        title: 'Нил Гилевич в Белорусском государственном университете имени В.И. Ленина, 1977 год.',
      },
      {
        img: poet4_4,
        title: 'С Максимом Танком, 1977 год.',
      },
      {
        img: poet4_5,
        title: 'Нил Гилевич, Анатолий Вертинский, Геннадий Буравкин, Владимир Анискович в редакции "Літаратура і Мастацтва". 1979 год.',
      },
      {
        img: poet4_6,
        title: 'Нил Гилевич разрезает ленточку на открытии музея белорусского поэта Максима Богдановича, 1987 год.',
      },
    ],
  },
  {
    id: 5,
    name: 'Василий Васильевич Зуёнок',
    avatar: avatar_5,
    occupation: 'поэт, переводчик, редактор',
    birthDate: '03.06.1935',
    birthPlace: 'д. Мачулищи, Крупский район, Минская область, Белорусская ССР, СССР',
    locationsCoords: {
      lat: '53.902496',
      lng: '27.561481',
    },
    works: [
      {
        name: 'Крэсіва',
        publishYear: '1960',
      },
      {
        name: 'Крутаяр',
        publishYear: '1969',
      },
      {
        name: 'Маўчанне травы',
        publishYear: '1980',
      },
      {
        name: 'Лета трывожных дажджоў',
        publishYear: '1990',
      },
    ],
    youTubeVideoId: 'CNNB9f5tCHM',
    activity: [
      {
        date: '03.06.1935',
        place: 'Мачулищи',
        description: 'Родился в крестьянской семье в деревне Мачулищи Крупского района Минской области Белоруссии.',
      },
      {
        date: '1954',
        place: 'Минск',
        description: 'Окончил Борисовское педагогическое училище.',
      },
      {
        date: '1959',
        place: 'Минск',
        description: 'Окончил отделение журналистики филологического факультета Белорусского государственного университета.',
      },
      {
        date: '1960—1966',
        place: 'Минск',
        description: 'Работал в редакции газеты «Пионер Беларуси».',
      },
      {
        date: '1966—1972',
        place: 'Минск',
        description: 'Работал заместителем главного редактора литературного журнала «Маладосць».',
      },
      {
        date: '1978—1982',
        place: 'Минск',
        description: 'Работал главным редактором литературного журнала «Маладосць».',
      },
      {
        date: '1982—1989',
        place: 'Минск',
        description: 'Секретарь председателя Союза писателей Беларуси.',
      },
      {
        date: '1990—1998',
        place: 'Минск',
        description: 'Председатель Союза писателей Беларуси.',
      },
    ],
    imgData: [
      {
        img: poet5_1,
        title: 'Василий Зуенок поздравляет Кондрата Крапиву',
      },
      {
        img: poet5_2,
        title: 'Василий Зуенок и Микола Ахрамчик ',
      },
      {
        img: poet5_3,
        title: 'С Рыгором Бородулиным и Эдуардом Доморацким',
      },
      {
        img: poet5_4,
        title: 'С Геннадием Буравкиным',
      },
    ],
  },
  {
    id: 6,
    name: 'Александр Михайлович Куллинкович',
    avatar: avatar_6,
    occupation: 'музыкант, поэт, журналист, актёр, певец, композитор',
    birthDate: '18.05.1972',
    birthPlace: 'Смолевичи, Минская область, Белорусская ССР, СССР',
    deathDate: '04.08.2018',
    deathPlace: 'Минск, Беларусь',
    locationsCoords: {
      lat: '53.902496',
      lng: '27.561481',
    },
    works: [
      {
        name: 'Выше неба',
        publishYear: '2012',
      },
      {
        name: 'ГараШ',
        publishYear: '2015',
      },
    ],
    youTubeVideoId: 'S5y5RxN-Xeg',
    activity: [
      {
        date: '18.05.1972',
        place: 'Смолевичи',
        description: 'Родился в Смолевичах, с пяти лет жил в Минске.',
      },
      {
        date: '1985',
        place: 'Минск',
        description: 'С 1985 года писал стихи и музыку.',
      },
      {
        date: '17.07.1989',
        place: 'Минск',
        description: 'Основал группу Neuro Dubel, лидером которой и являлся до своей смерти. Писал музыку и тексты.',
      },
      {
        date: '1998, 2007',
        place: 'Минск',
        description: 'Дважды группа становилась обладателем «Рок-короны» (в 1998 и 2007 годах).',
      },
      {
        date: '2000-е',
        place: 'Минск',
        description:
          'В начале 2000-х годов сотрудничал с группой «Крамбамбуля». Писал статьи для «БелГазеты», «Советской Белоруссии», сайта Naviny.by и журнала «Sexus».',
      },
      {
        date: '03.08.2018',
        place: 'Минск',
        description:
          '3 августа 2018 года Александр отправил СМС барабанщику группы Андрею Степанюку, что ' +
          'плохо себя чувствует и вызывает скорую. Музыкант попал в реанимацию. Умер утром 4 августа. ' +
          'Причиной смерти называют проблемы с лёгкими, точнее «скрытое воспаление лёгких». В день ' +
          'смерти музыканта группа Neuro Dubel должна была выступать на фестивале «Рок за Бобров». ' +
          'Прощание прошло 5 августа в зале крематория на Северном кладбище Минска.',
      },
    ],
    imgData: [
      {
        img: poet6_1,
        title: 'Александр Куллинкович, лидер группы Neuro Dubel',
      },
      {
        img: poet6_2,
        title: 'Neuro Dubel',
      },
      {
        img: poet6_3,
        title: '',
      },
      {
        img: poet6_4,
        title: '',
      },
    ],
  },
];
