import avatar_1 from '../img/avatars/Borodulin_RI.jpg';
import avatar_2 from '../img/avatars/Brovka_PU.jpg';
import avatar_3 from '../img/avatars/Byadulya_Z.jpg';
import avatar_4 from '../img/avatars/Gilevich_NS.jpg';
import avatar_5 from '../img/avatars/Zuenok_VV.jpg';
import avatar_6 from '../img/avatars/Kullinkovich_AM.jpg';

export default [
  {
    id: 1,
    name: 'Григорий Иванович Бородулин',
    englishName: 'Grigory Ivanovich Borodulin',
    belarusianName: 'Рыгор Іванавіч Барадулін',
    avatar: avatar_1,
    occupation: 'поэт, эссеист, переводчик',
    birthDate: '24.02.1935',
    birthPlace: 'хутор Вересовка, Ушачский район, Витебская область, БССР, СССР',
    deathDate: '02.03.2014',
    deathPlace: 'Минск, Беларусь',
    locationsCoords: {
      lat: '53.902496',
      lng: '27.561481',
    },
    works: [
      {
        name: 'Месяц над степью',
        publishYear: '1959',
      },
      {
        name: 'Слова о полку Игореве',
        publishYear: '1986',
      },
      {
        name: 'Руны Перуновы',
        publishYear: '2006',
      },
    ],
    youTubeVideoId: 'WzJFsmUvTzI',
    activity: [
      {
        date: '24.02.1935',
        place: 'Вересовка',
        description:
          'Родился на хуторе Вересовка, официальное название хутора было «Городок-2» ' +
          '(ныне это северо-западная окраина дер. Тихоняты Сорочинского сельсовета).',
      },
      {
        date: '1954',
        place: 'Вересовка',
        description: 'Окончил Ушачскую среднюю школу.',
      },
      {
        date: '1959',
        place: 'Вересовка',
        description: 'Окончил филологический факультет БГУ.',
      },
      {
        date: '1984',
        place: 'Лусака, Замбия',
        description: 'В составе государственной делегации Белорусской ССР Бородулин принимал участие в 39 сессии Генеральной ассамблеи ООН.',
      },
      {
        date: '1992',
        place: 'Минск',
        description: 'Стал последним белорусом, удостоившимся звания народного поэта.',
      },
      {
        date: '02.03.2014',
        place: 'Минск',
        description: 'Умер 2 марта 2014 года в своей квартире в Минске на 80-ом году жизни от болезни Паркинсона.',
      },
    ],
  },
  {
    id: 2,
    name: 'Пётр Устинович Бровка',
    englishName: 'Petr Ustinovich Brovka',
    belarusianName: 'Пётр Усцінавіч Броўка',
    avatar: avatar_2,
    occupation: 'поэт, прозаик, переводчик, драматург, публицист, редактор',
    birthDate: '25.06.1905',
    birthPlace: 'Путилковичи, Борисовский уезд, Минская губерния, Российская империя',
    deathDate: '24.03.1980',
    deathPlace: 'Минск, БССР, СССР',
    locationsCoords: {
      lat: '53.902496',
      lng: '27.561481',
    },
    works: [
      {
        name: 'Цэхавыя будні',
        publishYear: '1931',
      },
      {
        name: 'Прыход героя',
        publishYear: '1935',
      },
      {
        name: 'Вершы і паэмы',
        publishYear: '1940',
      },
      {
        name: 'Пахне чабор',
        publishYear: '1959',
      },
    ],
    youTubeVideoId: 'y7q6WXFqP2I',
    activity: [
      {
        date: '25.06.1905',
        place: 'Путилковичи',
        description:
          'Родился 25 июня 1905 года в деревне Путилковичи ' +
          '(ныне Ушачский район, Витебская область, Белоруссия) в крестьянской ' +
          'семье (9 детей). Отец — Устин Адамович. Мать — Алёна Степановна. ' +
          'Окончил церковно-приходскую школу в Лепеле.',
      },
      {
        date: '1918—1924',
        place: 'Полоцк',
        description:
          'В 1918—1924 годах работал переписчиком, делопроизводителем ' +
          'и счетоводом. В 1925—1927 годах был завотделом Окружкома комсомола в ' +
          'Полоцке. ',
      },
      {
        date: '1925—1927',
        place: 'Полоцк',
        description: 'В 1925—1927 годах был завотделом Окружкома комсомола в Полоцке.',
      },
      {
        date: '1927—1928',
        place: 'Полоцк',
        description: 'В 1927—1928 годах — ответственным секретарём редакции ' + 'газеты «Чырвоная Полаччына».',
      },
      {
        date: '1928',
        place: 'Минск',
        description: 'С 1928 года — в литературном объединении «Маладняк», позже в ' + 'Белорусской ассоциации пролетарских писателей (БелАПП).',
      },
      {
        date: '1941—1942',
        place: 'Минск',
        description: 'В 1941—1942 году служил в РККА, работал во фронтовой и ' + 'партизанской печати.',
      },
      {
        date: '1943—1945',
        place: 'Минск',
        description: 'В 1943—1945 годах был ответственным секретарём СП БССР, ' + 'главный редактор литературного журнала «Полымя».',
      },
      {
        date: '1948—1967',
        place: 'Минск',
        description: 'В 1948—1967 годы — председателем Правления СП БССР.',
      },
      {
        date: '1967—1980',
        place: 'Минск',
        description:
          'В 1967—1980 годы — главный редактор Белорусской советской ' + 'энциклопедии (ныне — «Белорусская Энциклопедия имени П. Бровки»).',
      },
      {
        date: '24.03.1980',
        place: 'Минск',
        description: 'П. У. Бровка умер 24 марта 1980 года в Минске. Похоронен на Восточном кладбище.',
      },
    ],
  },
  {
    id: 3,
    name: 'Змитрок Бядуля',
    englishName: 'Zmitrok Byadula',
    belarusianName: 'Змітрок Бядуля',
    avatar: avatar_3,
    occupation: 'поэт, прозаик',
    birthDate: '23.04.1886',
    birthPlace: 'д. Посадец, Виленская губерния, Российская империя',
    deathDate: '03.11.1941',
    deathPlace: 'Уральск, Казахская ССР, СССР',
    locationsCoords: {
      lat: '53.902496',
      lng: '27.561481',
    },
    works: [
      {
        name: 'Пад родным небам',
        publishYear: '1922',
      },
      {
        name: 'Буралом',
        publishYear: '1925',
      },
      {
        name: 'Тры пальцы',
        publishYear: '1930',
      },
    ],
    youTubeVideoId: 'Ic6BBVPd5lc',
    activity: [
      {
        date: '23.04.1886',
        place: 'Посадец',
        description:
          'Самуил (Шмуэл-Нохим) Плавник[1][2], впоследствии известный под литературным ' +
          'псевдонимом Змитрок Бядуля, родился в небогатой еврейской семье.',
      },
      {
        date: '1910',
        place: 'Вильно',
        description: 'Самуил Плавник стал постоянным автором виленской газеты «Наша Ніва».',
      },
      {
        date: '1918',
        place: 'Минск',
        description: 'Сотрудничал с газетой «Беларускі шлях», выходившей под немецкой оккупацией.',
      },
      {
        date: '1918-1919',
        place: 'Минск',
        description: 'Сочувствовал БНР, был автором ряда резко антибольшевистских статей.',
      },
      {
        date: '03.11.1941',
        place: 'Уральск',
        description: 'Скончался около Уральска в Казахстане, где и был похоронен',
      },
    ],
  },
  {
    id: 4,
    name: 'Нил Симеонович Гилевич',
    englishName: 'Neil Simeonovich Gilevich',
    belarusianName: 'Ніл Симеонович Гілевіч',
    avatar: avatar_4,
    occupation: 'поэт, переводчик, литературовед, фольклорист',
    birthDate: '30.09.1931',
    birthPlace: 'дер. Слобода, Логойский район Минской области, БССР, СССР',
    deathDate: '29.03.2016',
    deathPlace: 'Минск, Беларусь',
    locationsCoords: {
      lat: '53.902496',
      lng: '27.561481',
    },
    works: [
      {
        name: 'Песня ў дарогу',
        publishYear: '1957',
      },
      {
        name: 'Прадвесне ідзе па зямлі',
        publishYear: '1959',
      },
      {
        name: 'Неспакой',
        publishYear: '1961',
      },
      {
        name: 'Дождж-грыбасей',
        publishYear: '1966',
      },
    ],
    youTubeVideoId: 'gSHXeS3sXmk',
    activity: [
      {
        date: '23.04.1886',
        place: 'Слобода',
        description: 'Родился 30 сентября 1931 года в д. Слобода Логойского района Минской области в крестьянской семье.',
      },
      {
        date: '1940-е',
        place: 'Слобода',
        description: 'В середине 1940-х некоторое время работал сельским почтальоном.',
      },
      {
        date: '1951—1956',
        place: 'Минск',
        description:
          'Окончил Минское педагогическое училище имени Н. К. Крупско, филологический факультет Белорусского государственного университета и аспирантуру при нём.',
      },
      {
        date: '1958—1963',
        place: 'Минск',
        description: 'Работал также литературным консультантом газеты «Звязда».',
      },
      {
        date: '1980—1989',
        place: 'Минск',
        description: 'Первый секретарь правления Союза писателей Белорусской ССР.',
      },
      {
        date: '1989',
        place: 'Минск',
        description: 'Председатель ТБМ им. Франциска Скорины, главный редактор бюллетеня данной организации «Наша слова».',
      },
      {
        date: '1985—1995',
        place: 'Минск',
        description: 'Депутат Верховного Совета XI и XII созывов.',
      },
      {
        date: '1990—1995',
        place: 'Минск',
        description: 'Председатель Комитета по образованию, культуре и сохранению исторического наследия.',
      },
      {
        date: '29.03.2016',
        place: 'Минск',
        description: 'Скончался в Минске от онкологического заболевания.',
      },
    ],
  },
  {
    id: 5,
    name: 'Василий Васильевич Зуёнок',
    englishName: 'Vasily Vasilyevich Zuyonok',
    belarusianName: 'Васіль Васільевіч Зуёнак',
    avatar: avatar_5,
    occupation: 'поэт, переводчик, редактор',
    birthDate: '03.06.1935',
    birthPlace: 'д. Мачулищи, Крупский район, Минская область, Белорусская ССР, СССР',
    locationsCoords: {
      lat: '53.902496',
      lng: '27.561481',
    },
    works: [
      {
        name: 'Крэсіва',
        publishYear: '1960',
      },
      {
        name: 'Крутаяр',
        publishYear: '1969',
      },
      {
        name: 'Маўчанне травы',
        publishYear: '1980',
      },
      {
        name: 'Лета трывожных дажджоў',
        publishYear: '1990',
      },
    ],
    youTubeVideoId: 'CNNB9f5tCHM',
    activity: [
      {
        date: '03.06.1935',
        place: 'Мачулищи',
        description: 'Родился в крестьянской семье в деревне Мачулищи Крупского района Минской области Белоруссии.',
      },
      {
        date: '1954',
        place: 'Минск',
        description: 'Окончил Борисовское педагогическое училище.',
      },
      {
        date: '1959',
        place: 'Минск',
        description: 'Окончил отделение журналистики филологического факультета Белорусского государственного университета.',
      },
      {
        date: '1960—1966',
        place: 'Минск',
        description: 'Работал в редакции газеты «Пионер Беларуси».',
      },
      {
        date: '1966—1972',
        place: 'Минск',
        description: 'Работал заместителем главного редактора литературного журнала «Маладосць».',
      },
      {
        date: '1978—1982',
        place: 'Минск',
        description: 'Работал главным редактором литературного журнала «Маладосць».',
      },
      {
        date: '1982—1989',
        place: 'Минск',
        description: 'Секретарь председателя Союза писателей Беларуси.',
      },
      {
        date: '1990—1998',
        place: 'Минск',
        description: 'Председатель Союза писателей Беларуси.',
      },
    ],
  },
  {
    id: 6,
    name: 'Александр Михайлович Кулинкович',
    englishName: 'Alexander Mikhailovich Kulinkovich',
    belarusianName: 'Аляксандр Міхайлавіч Кулінковіч',
    avatar: avatar_6,
    occupation: 'музыкант, поэт, журналист, актёр, певец, композитор',
    birthDate: '18.05.1972',
    birthPlace: 'Смолевичи, Минская область, Белорусская ССР, СССР',
    deathDate: '04.08.2018',
    deathPlace: 'Минск, Беларусь',
    locationsCoords: {
      lat: '53.902496',
      lng: '27.561481',
    },
    works: [
      {
        name: 'Выше неба',
        publishYear: '2012',
      },
      {
        name: 'ГараШ',
        publishYear: '2015',
      },
    ],
    youTubeVideoId: 'S5y5RxN-Xeg',
    activity: [
      {
        date: '18.05.1972',
        place: 'Смолевичи',
        description: 'Родился в Смолевичах, с пяти лет жил в Минске.',
      },
      {
        date: '1985',
        place: 'Минск',
        description: 'С 1985 года писал стихи и музыку.',
      },
      {
        date: '17.07.1989',
        place: 'Минск',
        description: 'Основал группу Neuro Dubel, лидером которой и являлся до своей смерти. Писал музыку и тексты.',
      },
      {
        date: '1998, 2007',
        place: 'Минск',
        description: 'Дважды группа становилась обладателем «Рок-короны» (в 1998 и 2007 годах).',
      },
      {
        date: '2000-е',
        place: 'Минск',
        description:
          'В начале 2000-х годов сотрудничал с группой «Крамбамбуля». Писал статьи для «БелГазеты», «Советской Белоруссии», сайта Naviny.by и журнала «Sexus».',
      },
      {
        date: '03.08.2018',
        place: 'Минск',
        description:
          '3 августа 2018 года Александр отправил СМС барабанщику группы Андрею Степанюку, что ' +
          'плохо себя чувствует и вызывает скорую. Музыкант попал в реанимацию. Умер утром 4 августа. ' +
          'Причиной смерти называют проблемы с лёгкими, точнее «скрытое воспаление лёгких». В день ' +
          'смерти музыканта группа Neuro Dubel должна была выступать на фестивале «Рок за Бобров». ' +
          'Прощание прошло 5 августа в зале крематория на Северном кладбище Минска.',
      },
    ],
  },
];
